meterhu/stm32f4/STM32F4BOOT/Transducer/RTUMode.c
//===============================================================================================
/************************************************************************************************
 *                                                                                                     
 *            文件名称:              
 *
 *                摘要: 
 *
 *            创建时间: 2012-05-20  
 *
 *            修改时间: 2012-05-20
 *            修改原因:
 *
 *                     
 *
 *                作者: 杨卫华
 *
 *************************************************************************************************/
//===============================================================================================
#include "stm32f4xx.h" 
#include "stm32f4_std_libs.h"
#include "mystd.h"  
#include "m_config.h"
#include "UserLib.h"
#include "UART.h"
#include "Transdu.h"



/*************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *************************************************************************************************/
void VFDRun(UINT16 rev_fwd, UINT16 rev_num)
{
    UINT8    i;
    UINT8   buff[20];
    UINT16  tmp_crc;
    
    
    //DelayS(2);
    ///Wait(500000);
    Wait(500000);  //2008-08-24 
    //ENA_RS485_OUT();  
    //写入频率
	buff[0] = 0x01;
	buff[1] = 0x06;  //写入单笔数据
	buff[2] = 0x09;  //地址
	buff[3] = 0x07;
	    
	rev_num *= 10;
	rev_num /= 3;
	        
	buff[4] = rev_num >> 8;
	buff[5] = rev_num & 0xFF;
	    
	tmp_crc = CRCCheck(buff, 6);
	    
	buff[6] = tmp_crc & 0xFF;   //低位在先
	buff[7] = tmp_crc >> 8;
	
	//ENA_RS485_OUT();        
	for (i = 0; i < 8; i++)
	{
  	    TRANS_COM_SEND_BYTE(buff[i]);
	    Wait(30);
	    
	} 
	  
	//Wait(600);    
	//DIS_RS485_OUT(); 
    Wait(500000);//2008-08-24 
    //Wait(600000);  
    
    
  	//ENA_RS485_OUT();  
    buff[0] = 0x01;
    buff[1] = 0x06;  //写入单笔数据
    buff[2] = 0x20;  //地址
    buff[3] = 0x00;  
    
    buff[4] = 0;
       
    if (rev_fwd == FWD_RUN)
    {   
        buff[5] = 0x12;
    }
    else if (rev_fwd == REV_RUN)
    {
        buff[5] = 0x22;
    
    }
    
    tmp_crc = CRCCheck(buff, 6);
    
    buff[6] = tmp_crc & 0xFF;   //低位在先
    buff[7] = tmp_crc >> 8;
    
    
    for (i = 0; i < 8; i++)
    {
        TRANS_COM_SEND_BYTE(buff[i]);
        Wait(30);
    
    }   
    
    //Wait(300000); 
    //Wait(600000); 
    //DIS_RS485_OUT(); 
          
}

//================================================================================================
/*************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *************************************************************************************************/
void VFDStop(UINT16 rev_fwd)
{
    UINT8   i;
    UINT8   buff[20];
    UINT16  tmp_crc;
    
    Wait(400000);  //2008-08-24 
    
    buff[0] = 0x01;
    buff[1] = 0x06;  //写入单笔数据
    buff[2] = 0x20;  //地址
    buff[3] = 0x00;
    
    buff[4] = 0x00;
    if (rev_fwd == FWD_STOP)
    {   
        buff[5] = 0x11;
    }
    else if (rev_fwd == REV_STOP)
    {
        buff[5] = 0x21;
    
    }
    
    tmp_crc = CRCCheck(buff, 6);
    
    buff[6] = tmp_crc & 0xFF;   //低位在先
    buff[7] = tmp_crc >> 8;
    
    //ENA_RS485_OUT();  
    for (i = 0; i < 8; i++)
    {
        TRANS_COM_SEND_BYTE(buff[i]);
        Wait(30);
    
    }  
    //Wait(600000); 
    //DIS_RS485_OUT();  
   
  
} 

